{
  "pageTitle": "Company History | Advantage Seal",
  "pageDescription": "Advantage Seal's history starts way back when Mr. Norbert Gits founded Pac-Seal® in Chicago, Illinois. A small company but found success focusing on product quality and exemplary customer service.",
  "pageKeywords": "Company History, Advantage Seal",
  "ogTitle": null,
  "ogImage": "/images/company-history/asiseal.webp",
  "ogType": null,
  "ogDescription": null,
  "twitterCardType": null,
  "twitterTitle": null,
  "twitterDescription": null,
  "twitterImage": null,
  "contents": [
    {
      "name": "1995",
      "image": "/images/company-history/1995.webp",
      "summary": "With the rapid growth of mechanical seal manufacturers, Pac-Seal® was acquired by Durametallic Corp in 1995. Two years later, Durametallic merged with Borg Warner Industrial Products to form Flowserve® Corp, which today stands as one of the four leading mechanical seal manufacturers worldwide."
    },
    {
      "name": "2002",
      "image": "/images/company-history/2002.webp",
      "summary": "Following the merger, the company’s strategic priorities evolved in alignment with broader corporate objectives, placing a greater emphasis on shareholder interests. Recognizing an opportunity to refocus on personalized service and technical excellence, a group of seasoned sealing experts and senior engineers founded Advantage Seal in 2002 in Bolingbrook, Illinois. Their mission was to reintroduce a customer-focused approach to the mechanical seals industry."
    },
    {
      "name": "2003-2004",
      "image": "/images/company-history/2003.webp",
      "summary": "Advantage Seal began by specializing in high-quality, cost-effective OEM mechanical seals for pool and spa applications. Driven by a commitment to continuous improvement, the company consistently innovated to better meet the evolving needs of its growing customer base. Before long, Advantage Seal successfully expanded into the OEM industrial and commercial pump mechanical seals market. Leveraging efficient manufacturing partnerships in China, the company maintained its ability to offer reliable, competitively priced products. This strategic approach facilitated steady growth, enabling Advantage Seal to expand its presence beyond the U.S. market into Europe and Asia."
    },
    {
      "name": "2005",
      "image": "/images/company-history/2005.webp",
      "summary": "In 2005, Advantage Seal strategically expanded its operations by establishing a state-of-the-art facility in Ningbo, China, mirroring its U.S. manufacturing excellence. This expansion seamlessly blended American innovation with China’s efficient manufacturing capabilities, enabling the company to consistently deliver high-quality, cost-effective sealing solutions. This strategic move not only enhanced production efficiency but also propelled Advantage Seal’s growth, extending its reach from the U.S. to Europe and Asia."
    },
    {
      "name": "2010",
      "image": "/images/company-history/2010.webp",
      "summary": "In 2010, Advantage Seal established its engineering support operations in the Philippines to strengthen its global service capabilities. This dedicated team plays a crucial role in supporting both the company’s manufacturing facility in China and customers around the world. Equipped with cutting-edge design software and advanced tools, the Philippine engineers specialize in analyzing and resolving the most demanding seal application challenges. They also conduct hands-on failure analysis directly at end-user sites, ensuring a deep understanding of real-world conditions. The insights gained are continually integrated into the design process, driving continuous improvement and innovation. This operation stands as a clear reflection of Advantage Seal’s unwavering commitment to customer-focused solutions, technical excellence, and global collaboration.”"
    },
    {
      "name": "2018",
      "image": "/images/company-history/2018.webp",
      "summary": "In 2018, Advantage Seal enhanced its Ningbo, China operation by integrating in-house rubber molding and precision machining departments. This strategic expansion allowed the company to streamline production, improve quality control, and significantly reduce manufacturing costs. By bringing these critical processes under one roof, Advantage Seal gained greater flexibility and responsiveness, enabling faster turnaround times and more competitive pricing. The result is enhanced value for customers—high-quality, reliable sealing solutions delivered with improved efficiency and service. This investment underscores Advantage Seal’s ongoing commitment to innovation, cost leadership, and exceeding customer expectations."
    },
    {
      "name": "Now and the Future",
      "image": "/images/company-history/asiseal.webp",
      "summary": "Looking ahead, Advantage Seal remains steadfast in its commitment to being the trusted partner of high-quality OEM pump manufacturers worldwide. The company continues to invest in advanced technologies, innovative design solutions, and world-class manufacturing processes to deliver sealing products that set industry standards. With a relentless focus on quality, reliability, and customer satisfaction, Advantage Seal is dedicated to not only meeting but exceeding the evolving needs of its customers—always ready to go the extra mile.\n\nAs part of its forward-thinking vision, Advantage Seal is also embracing sustainable practices and operational efficiencies to reduce environmental impact while supporting global growth. By fostering continuous innovation and strengthening partnerships across industries and regions, Advantage Seal is poised to lead the mechanical seals market into the future—offering value-driven, customer-centric solutions that stand the test of time."
    }
  ]
}
