{
  "pageTitle": "Company History | Advantage Seal",
  "pageDescription": "Advantage Seal's history starts way back when Mr. Norbert Gits founded Pac-Seal® in Chicago, Illinois. A small company but found success focusing on product quality and exemplary customer service.",
  "pageKeywords": "Company History, Advantage Seal",
  "ogTitle": null,
  "ogImage": "/images/company-history/asiseal.webp",
  "ogType": null,
  "ogDescription": null,
  "twitterCardType": null,
  "twitterTitle": null,
  "twitterDescription": null,
  "twitterImage": null,
  "contents": [
    {
      "name": "Early Years",
      "image": "/images/company-history/asiseal.webp",
      "summary": "Advantage Seal founders traces its roots back to Norbert Gits’ Pac-Seal® in Chicago, Illinois. Although a “small” company compared to the giants in the mechanical seals industry, they found success by focusing on product quality and exemplary customer service."
    },
    {
      "name": "1995",
      "image": "/images/company-history/1995.webp",
      "summary": "With the proliferation of various mechanical seals manufacturers, Pac-Seal® was sold to Durametallic Corp in 1995. Two years after, the company merged with Borg Warner Industrial Product to become Flowserve® Corp, one of the 4 major mechanical seals manufacturers at present."
    },
    {
      "name": "2002",
      "image": "/images/company-history/2002.webp",
      "summary": "After the merger, in order to be competitive, the focus shifted towards increasing the “stock value” instead of the “customer value.” Advantage Seal was founded in 2002, together with sealing experts and senior technical engineers in Bolingbrook, Illinois, in order to bring back the customer-centric values of the company."
    },
    {
      "name": "2003-2004",
      "image": "/images/company-history/2003.webp",
      "summary": "Advantage Seal initially specialized in affordable and quality OEM Pool and Spa mechanical seals. It consistently found ways to develop products to serve its growing market better. In no time, it penetrated the OEM industrial and commercial pump mechanical seals market as well.\nThe Chinese low-cost manufacturing capabilities ensured Advantage Seal is able to continually provide affordable, high-quality seals. This paved the way for market expansion from the US to Europe and Asia."
    },
    {
      "name": "2005",
      "image": "/images/company-history/2005.webp",
      "summary": "As demand increased, operations expanded to Ningbo, China in 2005, with the addition of modern facilities and equipment. The Chinese low-cost manufacturing capabilities ensured Advantage Seal is able to continually provide affordable, high-quality seals. This paved the way for market expansion from the US to Europe and Asia."
    },
    {
      "name": "2010",
      "image": "/images/company-history/2010.webp",
      "summary": "In 2010 Advantage Seal started operations in the Philippines to provide engineering support for customers and operations across the globe. Utilizing the latest design software and equipment, the engineering team analyzes and solves the most demanding seal application problems – a true mark of Advantage Seal’s commitment to its customers."
    },
    {
      "name": "2018",
      "image": "/images/company-history/2018.webp",
      "summary": "Advantage Seal China further expanded its operation by adding more molding and machining capabilities to serve the ever-growing demand."
    },
    {
      "name": "2022 and Beyond",
      "image": "/images/company-history/asiseal.webp",
      "summary": "Advantage Seal continues to serve high-quality OEM Pump manufacturers, innovating ways to deliver high-quality seals, and going the extra mile to ensure customer satisfaction."
    }
  ]
}
